eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_eth.h
/**
  ******************************************************************************
  * @file	 MDR32F9Qx_eth.h
  * @author	 sidorov.a
  * @version V1.4.0
  * @date    26.04.2013
  * @brief   This file contains all the the functions prototypes for the
  * 		 ethernet firmware library.
  ******************************************************************************
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2013 Milandr </center></h2>
  ******************************************************************************
  * FILE MDR32F9Qx_eth.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MDR32F9QX_ETH_H_
#define MDR32F9QX_ETH_H_

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stdint.h"	
#include "mdr32f8_config.h"
#include "MDR1986VE8T.h"	

/** @addtogroup __MDR32F9Qx_StdPeriph_Driver MDR32F9Qx Standard Peripherial Driver
  * @{
  */

/** @addtogroup ETHERNET
  * @{
  */

/** @defgroup ETH_Exported_Types ETH Exported Types
  * @{
  */

/**
  * @brief	ETH Init Structure definition
  * @note	The user should not configure all the ETH_InitTypeDef structure's fields.
  *   		By calling the ETH_StructInit function the structure’s fields are set to their default values.
  *   		Only the parameters that will be set to a non-default value should be configured.
  */
typedef struct {

	/**
	  *  @brief PHY
	  */

//	uint32_t 			ETH_PHY_Address;					/*!< Addres PHY.
//																 This parameter can be a value from 0 to 0x1F. */
//	uint32_t			ETH_PHY_Mode;						/*!< Selects the PHY MODE.
//													 	 	 	 This parameter can be a value of @ref ETH_PHY_MODE. */
//	uint32_t			ETH_PHY_Interface;					/*!< Selects the PHY interface.
//													 	 	 	 This parameter can be a value of @ref ETH_PHY_INTERFACE. */
	FunctionalState			ETH_PHY_LB;
	
	FunctionalState			ETH_PHY_DLB;
	
	FunctionalState			ETH_PHY_HALFD;

	FunctionalState			ETH_PHY_EARLY_DV;	
	
	uint32_t			ETH_PHY_DIR;	
	
	uint32_t			ETH_PHY_BASE_2;		
	
	uint32_t			ETH_PHY_LINK_PERIOD;	
	
	uint32_t			ETH_PHY_EXT_EN;		
	
	uint32_t			ETH_PHY_A_SELR;		
	
	uint32_t			ETH_PHY_A_TRIM;	
	
	uint32_t			ETH_PHY_A_TRIMR;
	
	/**
	  * @brief MAC General Config
	  */

	uint32_t			ETH_Dilimiter;						/*!< Defines the boundaries of the transmitter and receiver buffers.
													 	 	 	 This parameter can be a value from 0 to 0x1FFF. */
	uint32_t			ETH_DBG_Mode;						/*!< Select the mode of operation in debug mode.
													 	 	 	 This parameter can be a value of @ref ETH_DBG_MODE. */
	FunctionalState 	ETH_DBG_XF;							/*!< Enable or disable automatic change of the transmitter FIFO pointers.
	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_DBG_RF;							/*!< Enable or disable automatic change of the receiver FIFO pointers.
 	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Loopback_Mode;					/*!< Selects or not the internal MAC Loopback mode.
													 	 	 	 This parameter can be: ENABLE or DISABLE. */
	BitStatus			ETH_Receiver_RST;					/*!< Receiver reset bit.
	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 This parameter can be: SET or RESET. */
	BitStatus			ETH_Transmitter_RST;				/*!< Transmitter reset bit.
	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 	 This parameter can be: SET or RESET. */
	FunctionalState		ETH_Register_CLR;					/*!< Permission or prohibition of discharge status registers his reading.
																 This parameter can be: ENABLE or DISABLE. */
	uint32_t			ETH_Buffer_Mode;					/*!< Set the operating mode buffers.
													 	 	 	 This parameter can be a value of@ref ETH_BUFFER_MODE */
	FunctionalState		ETH_Extension_Mode;					/*!< Enable or disable mode additions to the size of short packets slotTime field "Extension".
													 	 	 	 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_HalfDuplex_Mode;				/*!< Enable or disable half-duplex operation.
													 	 	 	 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_DTRM;							/*!< Enable or disable mode deterministic delivery time.
													 	 	 	 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Pause;							/*!< Enable or disable the automatic packet processing PAUSE.
													 	 	 	 This parameter can be: ENABLE or DISABLE. */
	uint32_t			ETH_ColWnd;							/*!< Set the size of the "window collisions".
													 	 	 	 This parameter can be a value from 0 to 0xFF. */
	/**
	 * @brief	MAC Transmitter Config
	 */

	FunctionalState		ETH_Transmitter_State;				/*!< The state of the transmitter.
																 This parameter can be: ENABLE or DISABLE. */
	uint32_t			ETH_Transmitter_BE;					/*!< Set the sequence of bytes in the word transmitter.
																 This parameter can be a value of @ref ETH_TRANSMITTER_BE. */
	uint32_t 			ETH_Transmitter_Bits_Order;			/*!< The order of the bits in the transmission of data bytes.
																 This parameter can be a value of @ref ETH_TRANSMITTER_BITS_ORDER. */
	uint32_t			ETH_Transmitter_Event_Mode;			/*!< Defines mode of operation withdrawal EVNT[1].
															 	 This parameter can be a value of @ref ETH_TRANSMITTER_EVENT_MODE. */
	FunctionalState     ETH_Automatic_Pad_Strip;    		/*!< Enable or disable addition to the minimum packet length PAD-s.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Automatic_Preamble;				/*!< Enable or disable supplement packet preamble.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Automatic_CRC_Strip;			/*!< Enable or disable supplement package automatically calculated CRC.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Automatic_IPG;					/*!< Enable or disable curing system pauses between sending packets.
															     This parameter can be: ENABLE or DISABLE. */
	uint32_t			ETH_Retry_Counter;					/*!< Maximum number of attempts to send a packet.
																 This parameter can be a value from 0 to 0xF. */
	/**
	 * @brief	MAC Receiver Config
	 */

	FunctionalState		ETH_Receiver_State;					/*!< The state of the receiver.
																 This parameter can be: ENABLE or DISABLE. */
	uint32_t			ETH_Receiver_BE;					/*!< Set the sequence of bytes in the word receiver.
	  	  	  	  	  	  	  	  	  	  	  	  	  	  	  	 This parameter can be a value of @ref ETH_RECEIVER_BE. */
	uint32_t			ETH_Receiver_Bits_Order;			/*!< Set the sequence of bits at the reception of data bytes.
																 This parameter can be a value of @ref ETH_RECEIVER_BITS_ORDER. */
	uint32_t			ETH_Receiver_Event_Mode;			/*!< Defines mode of operation withdrawal EVNT[0].
																 This parameter can be a value of @ref ETH_RECEIVER_EVENT_MODE. */
	FunctionalState		ETH_Receive_All_Packets;			/*!< Selects or not all frames reception by the MAC (No filtering).
															     This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Short_Frames_Reception;			/*!< Enable or disable the reception of packets of less than the minimum.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Long_Frames_Reception;			/*!< Enable or disable the reception of packets longer than the maximum.
															     This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Broadcast_Frames_Reception;		/*!< Enable or disable Receiving packet broadcast MAC-address.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Error_CRC_Frames_Reception;		/*!< Enable or disable receiving packets with errors.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Control_Frames_Reception;		/*!< Enable or disable receiving control packets.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Unicast_Frames_Reception;		/*!< Enable or disable receiving packets with MAC-address specified in the register MAC_Address.
																 This parameter can be: ENABLE or DISABLE. */
	FunctionalState		ETH_Source_Addr_HASH_Filter;		/*!< Enable or disable receiving packets with a multicast MAC-address-filtered HAS-table.
																 This parameter can be: ENABLE or DISABLE. */
	/**
	 * @brief MAC Address
	 */

	uint16_t 			ETH_MAC_Address[3];					/*!< Individual MAC address */
	/**
	 * @brief Hash Table
	 */

	uint32_t            ETH_Hash_Table_High;             	/*!< This field holds the higher 32 bits of Hash table.  */
	uint32_t            ETH_Hash_Table_Low;              	/*!< This field holds the lower 32 bits of Hash table.  */
	/**
	 * @brief Time settings
	 */

	uint32_t 			ETH_IPG;							/*!< The value of inter-packet interval for full duplex
																 This parameter can be a value from 0 to 0xFFFF. */
	uint32_t 			ETH_PSC;							/*!< Prescaler value increment values ??BAG and JitterWnd.
																 This parameter can be a value from 0 to 0xFFFF. */
	uint32_t 			ETH_BAG;							/*!< The period value of the packets.
																 This parameter can be a value from 0 to 0xFFFF. */
	uint32_t 			ETH_JitterWnd;						/*!< Jitter value of packets transmitted.
																 This parameter can be a value from 0 to 0xFFFF. */
} ETH_InitTypeDef;


/**
 * @brief Bit-field structure of the state of the packet reception
 */
typedef struct{
	uint32_t Length			:16;		/*!< The number of bytes in the packet including header and CRC. */
	uint32_t PF_ERR			:1;			/*!< A sign package PAUSE. */
	uint32_t CF_ERR			:1;			/*!< A sign Management Pack (filtering by MAC and special tags in the field length - 13.14 - octets). */
	uint32_t LF_ERR			:1;			/*!< A sign excess packet length 1518 octets. */
	uint32_t SF_ERR			:1;			/*!< A sign of lack of packet length 64 octets. */
	uint32_t LEN_ERR		:1;			/*!< A sign mismatch between the actual length and the length specified in the length field - 13.14 octets. */
	uint32_t DN_ERR			:1;			/*!< A sign bit of the packet is not a multiple of 8. */
	uint32_t CRC_ERR		:1;			/*!< A sign mismatch packet CRC. */
	uint32_t SMB_ERR		:1;			/*!< A sign of the presence in the packet error nibbles. */
	uint32_t MCA			:1;			/*!< A sign group package (MAC matches HASH). */
	uint32_t BCA			:1;			/*!< A sign of the broadcast packet (MAC = FF:FF:FF:FF:FF:FF). */
	uint32_t UCA			:1;			/*!< A sign individual package (MAC corresponds to the set). */
}ETH_StatusPacketReceptionBitFileds;

/**
 * @brief The state of the packet reception	Unioun definition
 */
typedef union {
	uint32_t Status;								/*!< Specifies the fully status Word. */
	ETH_StatusPacketReceptionBitFileds Fields;		/*!< Specifies the particular field of the status word.*/
}ETH_StatusPacketReceptionTypeDef;

/** @} */ /* End of group ETH_Exported_Types */

