eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_eth.h
#define IS_ETH_RECEIVER_BITS_ORDER(ORDER)		((ORDER == ETH_RECEIVER_BITS_ORDER_LSB ) || \
												 (ORDER == ETH_RECEIVER_BITS_ORDER_MSB))

/** @} */ /* End of group ETH_RECIIVER_BITS_ORDER */

/** @defgroup ETH_RECEIVER_EVENT_MODE ETH_RECEIVER_EVENT_MODE
  * @{
  */

#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_EMPTY				(uint32_t)(0x0 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_ALMOST_EMPTY		(uint32_t)(0x1 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_HALF_EMPTY			(uint32_t)(0x2 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_ALMOST_FULL		(uint32_t)(0x3 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_FULL				(uint32_t)(0x4 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_PACET_RECEIVED				(uint32_t)(0x5 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_WORD_RECEIVED				(uint32_t)(0x6 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_PACET_DROPED				(uint32_t)(0x7 << ETH_R_CFG_EVNT_MODE_Pos)

#define ETH_RECEIVER_EVENT_MODE_MASK						(uint32_t)(0x7 << ETH_R_CFG_EVNT_MODE_Pos)

#define IS_ETH_RECEIVER_EVENT_MODE(MODE)					((MODE & (~ETH_RECEIVER_EVENT_MODE_MASK)) == 0)

/** @} */ /* End of group ETH_RECEIVER_EVENT_MODE */

/** @defgroup ETHERNET_Interrupt_defintions ETHERNET Interrupt defintions
  * @{
  */

#define ETH_MAC_IT_MII_RDY				(uint32_t)(0x00008000)
#define ETH_MAC_IT_MDIO_INT				(uint32_t)(0x00004000)
#define ETH_MAC_IT_CRS_LOST				(uint32_t)(0x00001000)
#define ETH_MAC_IT_LC					(uint32_t)(0x00000800)
#define ETH_MAC_IT_UNDF					(uint32_t)(0x00000400)
#define ETH_MAC_IT_XF_ERR				(uint32_t)(0x00000200)
#define ETH_MAC_IT_XF_OK				(uint32_t)(0x00000100)
#define ETH_MAC_IT_SF					(uint32_t)(0x00000080)
#define ETH_MAC_IT_LF					(uint32_t)(0x00000040)
#define ETH_MAC_IT_CF					(uint32_t)(0x00000020)
#define ETH_MAC_IT_CRC_ERR				(uint32_t)(0x00000010)
#define ETH_MAC_IT_SMB_ERR				(uint32_t)(0x00000008)
#define ETH_MAC_IT_OVF					(uint32_t)(0x00000004)
#define ETH_MAC_IT_MISSED_F				(uint32_t)(0x00000002)
#define ETH_MAC_IT_RF_OK				(uint32_t)(0x00000001)

#define IS_ETH_MAC_IT(IT)				(( IT & 0xFFFF2000 ) == 0)

/** @} */ /* End of group ETHERNET_Interrupt_defintions */

/** @defgroup ETHERNET_Flags ETHERNET Flags
  * @{
  */

#define ETH_MAC_FLAG_R_EMPTY				((uint32_t)0x00000001)
#define ETH_MAC_FLAG_R_AEMPTY				((uint32_t)0x00000002)
#define ETH_MAC_FLAG_R_HALF					((uint32_t)0x00000004)
#define ETH_MAC_FLAG_R_AFULL				((uint32_t)0x00000008)
#define ETH_MAC_FLAG_R_FULL					((uint32_t)0x00000010)
#define ETH_MAC_FLAG_X_EMPTY				((uint32_t)0x00000100)
#define ETH_MAC_FLAG_X_AEMPTY				((uint32_t)0x00000200)
#define ETH_MAC_FLAG_X_HALF					((uint32_t)0x00000400)
#define ETH_MAC_FLAG_X_AFULL				((uint32_t)0x00000800)
#define ETH_MAC_FLAG_X_FULL					((uint32_t)0x00001000)

#define IS_ETH_MAC_FLAG(FLAG)				((( FLAG & 0xFFFFE0E0 ) == 0) |\
											 (!(FLAG == 0)))

/** @} */ /* End of group ETHERNET_Flags */

/** @defgroup ETHERNET_Clock_Source ETHERNET Clock Source
  * @{
  */

#define ETH_PHY_CLOCK_SOURCE_HSI			(uint32_t)(0x00000000)
#define ETH_PHY_CLOCK_SOURCE_HSE0			(uint32_t)(0x00000001)
#define ETH_PHY_CLOCK_SOURCE_PLL0		  (uint32_t)(0x00000005)<<28
#define ETH_PHY_CLOCK_SOURCE_HSE1			(uint32_t)(0x30000002)

#define IS_ETH_CLOCK_SOURCE(CLOCK_SOURCE)		((CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSI) |\
												 (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSE0) |\
												 (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_PLL0) |\
												 (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSE1))

/** @} */ /* End of group ETHERNET_Clock_Source */

/** @defgroup ETHERNET_Clock_BRG ETHERNET Clock BRG
  * @{
  */

#define ETH_HCLKdiv1                       ((uint32_t)0x00000000)
#define ETH_HCLKdiv2                       ((uint32_t)0x00000001)
#define ETH_HCLKdiv4                       ((uint32_t)0x00000002)
#define ETH_HCLKdiv8                       ((uint32_t)0x00000003)
#define ETH_HCLKdiv16                      ((uint32_t)0x00000004)
#define ETH_HCLKdiv32                      ((uint32_t)0x00000005)
#define ETH_HCLKdiv64                      ((uint32_t)0x00000006)
#define ETH_HCLKdiv128                     ((uint32_t)0x00000007)

#define IS_ETH_CLOCK_BRG(BRG)              (((BRG) >= 0) && ((BRG) <= 7))

/** @} */ /* End of group ETHERNET_Clock_BRG */

/** @defgroup PHY_Clock_HCLKdiv PHY Clock HCLKdiv
  * @{
  */

#define ETH_PHY_HCLKdiv1                       ((uint32_t)0x00000000 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv2                       ((uint32_t)0x00000001 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv4                       ((uint32_t)0x00000002 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv8                       ((uint32_t)0x00000003 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv16                      ((uint32_t)0x00000004 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv32                      ((uint32_t)0x00000005 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv64                      ((uint32_t)0x00000006 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv128                     ((uint32_t)0x00000007 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)

#define IS_ETH_PHY_HCLKdiv(BRG)                (((~BRG) & 0x00070000) == 0)

/** @} */ /* End of group PHY_Clock_HCLKdiv */

/** @defgroup ETHERNET_Clock_Number ETHERNET Clock Number
  * @{
  */

#define ETH_CLK1							((uint32_t)0x01000000)
#define ETH_CLK2							((uint32_t)0x40000000)

#define IS_ETH_CLK(ETH_CLK)					((ETH_CLK == ETH_CLK1) ||\
											 (ETH_CLK == ETH_CLK2))
/** @} */ /* End of group ETHERNET_Clock_Number */

/* ETHERNET errors */
#define  ETH_ERROR              ((uint32_t)0)
#define  ETH_SUCCESS            ((uint32_t)1)

/**--------------------------------------------------------------------------**/
/**
  * @brief                     Description of common PHY registers
  */
/**--------------------------------------------------------------------------**/

