eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/inc/mdr32f8_eth.h
/** @defgroup ETH_PHY_FLAGs ETH PHY FLAGs
  * @{
  */

#define ETH_PHY_FLAG_MDINT			((uint32_t)0x00000400)
#define ETH_PHY_FLAG_MDO			((uint32_t)0x00000200)
#define ETH_PHY_FLAG_FX_VALID		((uint32_t)0x00000100)
#define ETH_PHY_FLAG_COL			((uint32_t)0x000000C0)
#define ETH_PHY_FLAG_CRS			((uint32_t)0x00000020)
#define ETH_PHY_FLAG_READY			((uint32_t)0x00000010)
#define ETH_PHY_FLAG_FULL_DUPLEX	((uint32_t)0x00000008)
#define ETH_PHY_FLAG_CARRIER_SENSE	((uint32_t)0x00000004)
#define ETH_PHY_FLAG_LINK			((uint32_t)0x00000002)
#define ETH_PHY_FLAG_100MBIT		((uint32_t)0x00000001)

#define IS_ETH_PHY_FLAG(FLAG)		((FLAG == ETH_PHY_FLAG_MDINT) 		||\
									 (FLAG == ETH_PHY_FLAG_MDO) 		||\
									 (FLAG == ETH_PHY_FLAG_FX_VALID)	||\
									 (FLAG == ETH_PHY_FLAG_COL) 		||\
									 (FLAG == ETH_PHY_FLAG_CRS) 		||\
									 (FLAG == ETH_PHY_FLAG_READY) 		||\
									 (FLAG == ETH_PHY_FLAG_FULL_DUPLEX) ||\
									 (FLAG == ETH_PHY_FLAG_CARRIER_SENSE) ||\
									 (FLAG == ETH_PHY_FLAG_LINK) 		||\
									 (FLAG == ETH_PHY_FLAG_100MBIT))

/** @} */ /* End of group ETH_PHY_FLAGs */

/** @defgroup PHY_Read_Write_Timeouts PHY Read write Timeouts
  * @{
  */

#define PHY_READ_TO                     ((uint32_t)0x0004FFFF)
#define PHY_WRITE_TO                    ((uint32_t)0x0004FFFF)

/** @} */ /* End of group PHY_Read_Write_Timeouts */

/** @defgroup PHY_Register_address PHY Register address
  * @{
  */

#define PHY_BCR							0          /*!< Basic Control Register */
#define PHY_BSR							1          /*!< Basic Status Register */
#define PHY_ID1							2
#define PHY_ID2							3
#define PHY_ATU							4
#define PHY_OPP_ATU						5
#define PHY_EATU						6
#define PHY_EMODE						18
#define PHY_IT_FLAGs					29
#define PHY_IT_MASKs					30
#define PHY_ECTR						31

#define IS_ETH_PHYReg(PHYreg)					(((PHYreg >= 0 ) &&  (PHYreg <= 6)) ||\
												 (PHYreg == 18) || (PHYreg == 29)   ||\
												 (PHYreg == 30) || (PHYreg == 31))

/** @} */ /* End of group PHY_Register_address */

/** @} */ /* End of group ETH_Exported_Macros */

/** @defgroup ETH_Private_Function_Prototypes ETH Private Function Prototypes
 * 	@{
 */

void ETH_ClockDeInit(void);
void ETH_PHY_ClockConfig(uint32_t clock_source, uint32_t PHY_HCLKdiv);
void ETH_BRGInit(uint32_t ETH_HCLKdiv);
void ETH_ClockCMD(FunctionalState NewState);
void ETH_PHY_Reset(MDR_ETH_TypeDef * ETHERNETx);
void ETH_PHYCmd(MDR_ETH_TypeDef * ETHERNETx, FunctionalState NewState);
void ETH_DeInit(MDR_ETH_TypeDef * ETHERNETx );
void ETH_StructInit(ETH_InitTypeDef * ETH_InitStruct);
void ETH_Init(MDR_ETH_TypeDef * ETHERNETx, ETH_InitTypeDef * ETH_InitStruct);
void ETH_Start(MDR_ETH_TypeDef * ETHERNETx);
void ETH_MACTransmissionCmd( MDR_ETH_TypeDef * ETHERNETx, FunctionalState NewState);
void ETH_MACReceptionCmd( MDR_ETH_TypeDef * ETHERNETx, FunctionalState NewState);
uint16_t ETH_GetMACITStatusRegister(MDR_ETH_TypeDef * ETHERNETx);
FlagStatus ETH_GetMACITStatus(MDR_ETH_TypeDef * ETHERNETx, uint32_t ETH_MAC_FLAG);
uint32_t ETH_GetMACStatusRegister(MDR_ETH_TypeDef * ETHERNETx);
void ETH_MACITConfig(MDR_ETH_TypeDef * ETHERNETx, uint32_t ETH_MAC_IT, FunctionalState NewState);
void ETH_MACAddressConfig(MDR_ETH_TypeDef * ETHERNETx, uint16_t *MacAddr);
void ETH_GetMACAddress(MDR_ETH_TypeDef * ETHERNETx, uint16_t *Addr);
FlagStatus ETH_GetPHYStatus(MDR_ETH_TypeDef * ETHERNETx, uint16_t ETH_PHY_FLAG);
uint16_t ETH_ReadPHYRegister(MDR_ETH_TypeDef * ETHERNETx, uint16_t PHYAddress, uint16_t PHYReg);
uint32_t ETH_WritePHYRegister(MDR_ETH_TypeDef * ETHERNETx, uint16_t PHYAddress, uint16_t PHYReg, uint16_t PHYValue);
uint32_t ETH_ReceivedFrame(MDR_ETH_TypeDef * ETHERNETx, uint32_t * ptr_InputBuffer);
void ETH_SendFrame(MDR_ETH_TypeDef * ETHERNETx, uint32_t * ptr_OututBuffer, uint32_t BufLen);
void ETH_DMAPrepare(void);
void ETH_DMAFrameRx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t * SrcBuf);
void ETH_DMAFrameTx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t *  SrcBuf);
FlagStatus ETH_GetFlagStatus(MDR_ETH_TypeDef * ETHERNETx, uint16_t ETH_MAC_FLAG);

/** @} */ /* End of group ETH_Private_Function_Prototypes */

/** @} */ /* End of group ETHERNET */

/** @} */ /* End of group __MDR32F9Qx_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* MDR32F9QX_ETH_H_ */

/******************* (C) COPYRIGHT 2013 Milandr ********************************
*
* END OF FILE MDR32F9Qx_eth.h */
